{
  "SapPiCredential": {
    "Username": "tmpi_web",
    "Password": "Web@pi123"
  },
  "EndPointTemplateUrl": "https://iss.adanielectricity.com/XISOAPAdapter/MessageServlet?senderParty=&senderService=Rel_Mob_App1&receiverParty=&receiverService=&interface={SERVICE}",
  "AccountTypeServiceName": "SI_CHECK_CA_TYPE_in&interfaceNamespace=http://rel.com/xi/RelMobApp/CHECK_CA_TYPE",
  "AccountDetailServiceName": "SI_ISUPARTNER_GETDETAIL_in&interfaceNamespace=http://rel.com/xi/RelMobApp/ISUPARTNER_GETDETAIL",
  "BillingLanguageServiceName": "SI_ZCSBLNG_in&interfaceNamespace=http://rel.com/xi/RelMobApp/ZCSBLNG",
  "EBillRegistrationServiceName": "SI_EBILL_REGISTER_in&interfaceNamespace=http://rel.com/xi/RelMobApp/EBILL_REGISTER",
  "PremiumAccountDetailServiceName": "SI_PVC_DISPLAY_in&interfaceNamespace=http://rel.com/xi/RelMobApp/PVC_DISPLAY",
  "ComplainStatusServiceName": "SI_COMP_STATUS_in&interfaceNamespace=http://rel.com/xi/RelMobApp/COMP_STATUS",
  "OutageInfoServiceName": "SI_OUTAGE_INFO_in&interfaceNamespace=http://rel.com/xi/RelMobApp/OUTAGE_INFO",
  "PaymentHistoryServiceName": "SI_PAYMT_HISTORY_in&interfaceNamespace=http://rel.com/xi/RelMobApp/PAYMT_HISTORY",
  "InvoiceHistoryServiceName": "SI_GET_BILL_MONTH_in&interfaceNamespace=http://rel.com/xi/RelMobApp/GET_BILL_MONTH",
  "ConsumptionHistoryServiceName": "SI_MTRREADDOC_GETLIST_in&interfaceNamespace=http://rel.com/xi/RelMobApp/MTRREADDOC_GETLIST",
  "AccountDueServiceName": "SI_MR_BI_GETLIST_in&interfaceNamespace=http://rel.com/xi/RelMobApp/MR_BI_GETLIST",
  "SecurityDepositServiceName": "SI_SD_in&interfaceNamespace=http://rel.com/xi/RelMobApp/SD",
  "VdsServiceName": "SI_VDS_WEB_PYMT_in&interfaceNamespace=http://rel.com/xi/RelMobApp/VDS_WEB_PYMT",
  "ViewBillServiceName": "SI_ONLINE_BILL_PDF_in&interfaceNamespace=http://rel.com/xi/RelMobApp/ONLINE_BILL_PDF",
  "ComplainStatuses": {
    "INVALIDCA": "Dear customer, the CA number entered is incorrect. Please refer the top left corner of your bill for the correct CA number.",
    "NOORDER": "Dear customer, this service is available for the complaints registered in the last 30 days.For the account number entered,no complaint has been registered with us in the last 30 days.In case you would like to register a complaint,Please write to us at energy.helpdesk@relianceada.comor call our toll free no.1800 200 3030",
    "INVALIDORD": "Dear customer, the complaint number entered is incorrect. Please enter a valid 10 digit complaint number. For required details you may call our toll free no. 1800 200 3030",
    "INVALIDILART": "Dear customer, currently, we are unable to provide the status of the complaint and regret for the same. We shall get back to you within 2 working days. Please bear with us in the interim.",
    "CI205": "Dear customer, your meter was replaced and tested in our laboratory and was found to be working within the specified accuracy limits. A letter to this effect is forwarded to your registered billing address.",
    "CI207": "Dear customer, your meter was replaced and tested  in our laboratory and found beyond accuracy limits. The necessary corrections in the bill will be done and forwarded to your registered billing address shortly.",
    "CI205A": "Dear customer, your meter was tested in our laboratory and was found to be working within the specified accuracy limits. A letter to this effect is forwarded to your registered billing address.",
    "CI213HCC": "Dear customer,your meter was replaced and tested  in our laboratory and found to have an error. The bill was corrected for the period FROMDATEX to TODATEX and UNITX units were credited to your account. The corrected bill has been forwarded to your registered billing address.",
    "CI213CAB": "Dear customer, with reference to your complaint registered with us, we have made the required corrections in your bill and the same has been forwarded to your registered billing address.",
    "CI213WDR": "Dear customer, with reference to your complaint registered with us the bill was corrected for the period FROMDATEX to TODATEX and UNITX units were credited to your account.The corrected bill has been forwarded to your registered billing address.",
    "CI202": "Dear customer, with reference to your complaint, your meter was inspected at your premise on  ONDATEX and checked for any kind of defects.No defects in the connection or the functioning of the meter have been observed. Also, the meter readings are accurate and the bills have been generated accordingly. A letter to this effect is forwarded to your registered billing address.",
    "CI235": "Dear customer, with reference to your complaint, your meter was inspected at your premise on ONDATEX and checked for any kind of defects.No defects in the connection or the functioning of the meter have been observed. Also, the meter readings are accurate and the bills have been generated accordingly. A letter to this effect is forwarded to your registered billing address.",
    "CI210": "Dear customer, with reference to your complaint, your meter was inspected at your premise on ONDATEX and checked for any kind of defects. No defects in the connection or the functioning of the meter have been observed. But the Earth Load indicator of your meter was ON. It suggests that there is a leakage in your wiring. We suggest you to check and rectifiy the wiring at your end through an authorised electrical inspector. A correct rectification of the same will be indicated by the OFF position of the Earth Load indicator on your meter. A letter to this effect is forwarded to your registered billing address.",
    "COU": "Dear customer, currently, we are unable to provide the status of the complaint and regret for the same. We shall get back to you within 2 working days. Please bear with us in the interim.",
    "CI231": "Dear customer, with reference to your complaint, your meter was inspected at your premise and checked for any kind of defects.No defects in the connection or the functioning of the meter have been observed. ",
    "WR": "Dear customer, your billing related complaint has been registered and is being processed on priority. ",
    "REPLACED": "Dear customer, with reference to your complaint, your meter was inspected and checked at site. The site inspection reflected a need to get the meter checked at the test laboratory and hence was replaced.",
    "TARIFMISUSE": "Dear customer, currently, we are unable to provide the status of the complaint and regret for the same. We shall get back to you within 2 working days. Please bear with us in the interim.",
    "INTERCHANGE": "Dear customer, with reference to your complaint, your meter was inspected at your premise and checked for any kind of defects. It is noticed that there is an interchange in the meter connections at your premise. You are requested to visit your nearest Customer Care Center.",
    "BOARDWIRING": "Dear customer, your billing related complaint has been registered and is being processed on priority. ",
    "TOBEREPL": "Dear customer, with reference to your complaint, your meter was inspected and checked at site. The site inspection reflected a need to get the meter checked at the test laboratory and hence will be replaced shortly.",
    "VIG": "Dear customer, currently, we are unable to provide the status of the complaint and regret for the same. We shall get back to you within 2 working days. Please bear with us in the interim.",
    "INPROCESS-2M": "Dear customer, your meter related complaint has been registered and is being processed on priority.",
    "INPROCESS-2B": "Dear customer, your billing related complaint has been registered and is being processed on priority.",
    "INPROCESS-2P": "Dear customer, your payment related complaint has been registered and is being processed on priority.",
    "INPROCESS-2BNR": "Dear customer, 'your Bill Not Received' complaint has been registered and is being processed on priority.",
    "RESOLVED-M": "Dear customer, with reference to your meter related complaint, the meter has been replaced with a newly tested meter. ",
    "RESOLVED-P": "Dear customer,  with reference to your payment related complaint, the same has been resolved. ",
    "RESOLVED-BNR": "Dear customer,  with reference to your 'Bill Not Received' complaint, a duplicate bill has been dispatched to your registered billing address.",
    "INPROCESS-6": "Dear customer, currently, we are unable to provide the status of the complaint and regret for the same. We shall get back to you within 2 working days. Please bear with us in the interim.",
    "9105-2": "Dear customer, your complaint for online payment has been registered and is being processed on priority",
    "9105-3": "Dear customer, your complaint has been resolved. You can now pay online. ",
    "9110-2": "Dear customer, your complaint for My Account has been registered and is being processed on priority.",
    "9110-3": "Dear customer, your complaint has been resolved. You can now log on to your account",
    "9115-2": "Dear customer, your complaint for website has been registered and is being processed on priority.",
    "9115-3": "Dear customer, your complaint has been resolved. You can now visit the requested link.",
    "9120-2": "Dear customer, your complaint for payment details on website has been registered and is being processed on priority.",
    "9120-3": "Dear customer, your complaint for payment history updation has been resolved. You may now check your updated payment history under My Account. ",
    "9125-2": "Dear customer, your complaint for Web bill has been registered and is being processed on priority",
    "9125-3": "Dear customer, your complaint has been resolved. You can now view your latest bill under My account.",
    "9130-2": "Dear customer, your complaint for e- bill has been registered and is being processed on priority",
    "9130-3": "Dear customer, your complaint has been resolved.The error is regretted. You can download this month's bill through your own My Account.",
    "9135-2": "Dear customer, your complaint for e- bill has been registered and is being processed on priority",
    "9135-3": "Dear customer, your complaint has been resolved.The error is regretted. You can download this month's bill through your own My Account.",
    "9140-2": "Dear customer, your complaint for e- bill has been registered and is being processed on priority",
    "9140-3": "Dear customer, your complaint has been resolved.The error is regretted. You can download this month's bill through your own My Account.",
    "9145-2": "Dear customer, your complaint for web bill has been registered and is being processed on priority",
    "9145-3": "Dear customer, your complaint has been resolved. You can now view your latest bill under My account. ",
    "9150-2": "Dear customer, your complaint for web bill has been registered and is being processed on priority",
    "9150-3": "Dear customer, your complaint has been resolved. You can now view your latest bill under My account. ",
    "9155-2": "Dear customer, your complaint for SMS services has been registered and is being processed on priority",
    "9155-3": "Dear customer, your complaint has been resolved. The error is regretted. SMS service to your registered mobile has been initiated.",
    "9160-2": "Dear customer, your complaint for SMS services has been registered and is being processed on priority",
    "9160-3": "Dear customer, your complaint has been resolved. The error is regretted. The mobile number registered for your account no. has been removed. Kindly update your contact details by either calling our call centre on 1800 200 3030 or writing to Energy.Helpdesk@relianceada.com.",
    "BLANK": "Dear customer, please enter your C.A. No. or 10 digit complaint number",
    "RESOLVED-B": "Dear customer, with reference to your billing related complaint, the same has been resolved.",
    "INPROCESS-2RBP": "Dear customer, your complaint has been registered and is being processed on priority.",
    "MANAMD": "With reference to your complaint registered with us, we have made the required corrections in your bill and the same has been forwarded to your registered billing address."
  }
}